package f_oop2;

public class Inheritance2 {

	public static void main(String[] args) {
		/*
		 * <<추상메서드>>
		 * -구현부가 없이 선언부만 존재하는 메서드이다.
		 * -abstract 리턴 타입 메서드명();
		 * -클래스 구현에 도움을 주기위해 사용한다.
		 * 
		 * <<추상 클래스>>
		 * - 추상메서드를 가진 클래스를 추상클래스라고 한다.
		 * abstract class 클래스명{}
		 * -추상클래스는 객체를 생성할 수 없고, 부모 클래스의 역할만 할 수 있다.
		 * 
		 * <<인터페이스>>
		 * - 상수와 추상메서드만 멤버로 가질 수 있는 데이터 구조이다.
		 * - Interface 인터페이습명{}
		 * -모든 멤버변수의 제어자는 public static final 이며, 생략할 수 있다.
		 * -모든 메서드의 제어자는 public abstract이며, 생략 할 수 있다.
		 * 
		 * <<내부클래스>>
		 * - 클래스 내부에서 선언된 클래스이다.
		 * - 선언된 위치와 형태에 따라 여러가지로 나누어진다.
		 * - 인스턴스 클래스 : 멤버변수 선언위치에 선언하며, 인스턴스 멤버들과 관련된 작업에 사용된다.
		 * - 스태틱 클래스 : static 이 붙고 멤버변수 선언위치에 선언하며, static 멤버들과 관련된 작업에 사용된다.
		 * - 지역 클래스 : 메서드나 초기화블럭 안에 선언하며, 선언된 영역내부에서만 사용할 수 있다.
		 * - 익명 클래스 : 이름이 없고, 선언과 객체 생성을 동시에 한다.(일회용)
		 */
		
		// GUI와 CUI(CLI)  설명
		/*
		 * GUI :Graphical User Interface의 약자
		 * - 사용자가 그림을 보고 프로그램과 상호작용 한다.
		 * - AWT, Swing, JavaFX
		 * - 내부클래스를 만들때 사용
		 * 
		 * CUI : Character User Interface의 약자(Command-line Interface)
		 * - 사용자가 글자를 보고 프로그램과 상호작용 한다.
		 * - 콘솔창, cmd
		 */
		
	}

}
